app/Controllers/AccesoController.php

SELECT *
FROM `usuarios`
WHERE `email` = 'tg8189041@gmail.com'
 LIMIT 1
SELECT *
FROM `usuarios`
WHERE `nombre` = 'bran villegas'
 LIMIT 1
---
    public function login(): RedirectResponse
    {
        if (!$this->request->is('post')) {
            return redirect()->to(site_url('acceso/login'));
        }

        $rules = [
            'username' => 'required|min_length[3]|max_length[100]',
            'password' => 'required|min_length[6]|max_length[255]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('toast_error', array_values($this->validator->getErrors()));
        }

        $username = trim((string) $this->request->getPost('username'));
        $pass     = (string) $this->request->getPost('password');

        $usuarioModel = new UsuarioModel();


        if (str_contains($username, '@')) {
            $user = $usuarioModel->where('email', $username)->first();
        } else {
            $user = $usuarioModel->where('nombre', $username)->first();

INSERT INTO `usuarios` (`id_categoria`, `nombre`, `email`, `password`, `rol`, `estado`) VALUES (NULL, 'Julio Antonio', 'tg8189041@gmail.com', '$2y$10$.wweZvsRzSRG9VxKVI8Z4uy.Z/trRUde.TWjQkwvbONhEp/NtwHi6', 'CLIENTE', 1)
---
        'estado'       => 1,
    ];

    $id = (int) $usuarioModel->insert($payload, true);