app/Controllers/ContactoController.php

        $token = bin2hex(random_bytes(24));

        // ✅ Guardar registro (para poder verificar después con el link)
        $idContacto = (int) $contactoModel->insert([
            'nombre'             => $nombre,
            'email'              => $email,
            'asunto'             => $asunto,
            'mensaje'            => $mensaje,

            // destino
            'miembro_id'         => $miembro['id'],
            'miembro_nombre'     => $miembro['nombre'],
            'miembro_email'      => $miembro['email'],

            // verificación
            'token_verificacion' => $token,
            'verificado'         => 0,

            // trazabilidad
            'fecha_creacion'     => date('Y-m-d H:i:s'),
            'ip'                 => $this->request->getIPAddress(),
            'user_agent'         => substr((string)$this->request->getUserAgent(), 0, 250),
        ]);
---
INSERT INTO `contactos` (`nombre`, `email`, `asunto`, `mensaje`, `miembro_id`, `miembro_nombre`, `miembro_email`, `token_verificacion`, `verificado`, `fecha_creacion`, `ip`, `user_agent`) VALUES ('Julio Antonio', 'tg8189041@gmail.com', 'Soporte', '32232323232', 'dev3', 'Integrante 3', 'miembro3@gmail.com', 'c32d23876df98ca0ade649040603023c3735dc1f40dd4c12', 0, '2026-02-02 04:08:58', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/144.0.0.0 Safari/537.36')

    public function verificar(string $token)
    {
        $mov = new MovimientoModel();
        $contactoModel = new ContactoModel();
        $mailer = new Mailer();

        $contacto = $contactoModel->where('token_verificacion', $token)->first();

        if (! $contacto) {
            $mov->log(null, 'contacto_token_invalido', "token: {$token}");
            return view('contacto/verificado', ['ok' => false, 'msg' => 'Token inválido o expirado.']);
        }

        if ((int)$contacto['verificado'] === 1) {
            return view('contacto/verificado', ['ok' => true, 'msg' => 'Tu correo ya estaba verificado ✅']);
        }

        // ✅ marcar verificado
        $contactoModel->update($contacto['id_contacto'], [
            'verificado' => 1
        ]);
---
SELECT *
FROM `contactos`
WHERE `token_verificacion` = 'c32d23876df98ca0ade649040603023c3735dc1f40dd4c12'
 LIMIT 1
UPDATE `contactos` SET `verificado` = 1
WHERE `contactos`.`id_contacto` IN ('2')