app/Models/MovimientoModel.php

INSERT INTO `movimientos` (`id_usuario`, `accion`, `descripcion`) VALUES (NULL, 'contacto_verificado', 'ID: 2 | remitente: tg8189041@gmail.com')
---
    public function log(?int $idUsuario, string $accion, ?string $descripcion = null): int
    {
        return (int) $this->insert([
            'id_usuario'  => $idUsuario,
            'accion'      => $accion,
            'descripcion' => $descripcion,
        ]);